In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot

In [2]:
valid_lines = []
with open('movie_titles.csv', 'r', encoding='latin-1') as file:
    for line in file:
        try:
            fields = line.strip().split(',')
            if len(fields) == 3:
                valid_lines.append(fields)
        except Exception as e:
            pass
            
data = pd.DataFrame(valid_lines, columns=['ID do filme', 'Ano de lançamento', 'Título'])

In [3]:
data.head(2)

  ID do filme Ano de lançamento                      Título
0           1              2003             Dinosaur Planet
1           2              2004  Isle of Man TT 2004 Review

In [4]:
data_rating = pd.read_csv('combined_data_1.txt',header = None, names = ['Cust_Id', 'Rating'], usecols = [0,1])

In [5]:
data_rating.head()

   Cust_Id  Rating
0       1:     NaN
1  1488844     3.0
2   822109     5.0
3   885013     4.0
4    30878     4.0

In [6]:
data_rating.describe()

             Rating
count  2.405376e+07
mean   3.599634e+00
std    1.086118e+00
min    1.000000e+00
25%    3.000000e+00
50%    4.000000e+00
75%    4.000000e+00
max    5.000000e+00

In [7]:
data_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24058263 entries, 0 to 24058262
Data columns (total 2 columns):
 #   Column   Dtype
---  ------   -----
 0   Cust_Id  object
 1   Rating   float64
dtypes: float64(1), object(1)
memory usage: 367.1+ MB

In [8]:
data_rating.isnull().sum()

Cust_Id       0
Rating     4499
dtype: int64

In [9]:
movie_start_rows = data_rating[data_rating['Cust_Id'].str.contains(':')]
movie_start_rows

         Cust_Id  Rating
0             1:     NaN
548           2:     NaN
694           3:     NaN
2707          4:     NaN
2850          5:     NaN
...          ...     ...
24046714   4495:     NaN
24047329   4496:     NaN
24056849   4497:     NaN
24057564   4498:     NaN
24057834   4499:     NaN

[4499 rows x 2 columns]

In [10]:
movie_start_indices = movie_start_rows.index
movie_start_indices

Index([       0,      548,      694,     2707,     2850,     3991,     5011,
           5105,    20016,    20112,
       ...
       24020134, 24030393, 24030847, 24040201, 24046583, 24046714, 24047329,
       24056849, 24057564, 24057834],
      dtype='int64', length=4499)

In [11]:
data_rating['ID do filme'] = ''

In [12]:
for i in range(len(movie_start_indices) - 1):
    start_idx = movie_start_indices[i]
    end_idx = movie_start_indices[i + 1]
    
    movie_name = data_rating.loc[start_idx, 'Cust_Id']
    data_rating.loc[start_idx + 1:end_idx - 1, 'ID do filme'] = movie_name

In [13]:
data_rating = data_rating[~data_rating['Cust_Id'].str.contains(':')]
data_rating

          Cust_Id  Rating ID do filme
1         1488844     3.0          1:
2          822109     5.0          1:
3          885013     4.0          1:
4           30878     4.0          1:
5          823519     3.0          1:
...           ...     ...         ...
24058258  2591364     2.0
24058259  1791000     2.0
24058260   512536     5.0
24058261   988963     3.0
24058262  1704416     3.0

[24053764 rows x 3 columns]

In [14]:
data_rating.loc[:, 'Cust_Id'] = data_rating['Cust_Id'].astype(int)
data_rating

          Cust_Id  Rating ID do filme
1         1488844     3.0          1:
2          822109     5.0          1:
3          885013     4.0          1:
4           30878     4.0          1:
5          823519     3.0          1:
...           ...     ...         ...
24058258  2591364     2.0
24058259  1791000     2.0
24058260   512536     5.0
24058261   988963     3.0
24058262  1704416     3.0

[24053764 rows x 3 columns]

In [15]:
data.head()

  ID do filme Ano de lançamento                        Título
0           1              2003               Dinosaur Planet
1           2              2004    Isle of Man TT 2004 Review
2           3              1997                     Character
3           4              1994  Paula Abdul's Get Up & Dance
4           5              2004      The Rise and Fall of ECW

In [16]:
data_rating['ID do filme'] = data_rating['ID do filme'].str.replace(':', '')
data_rating.head()

   Cust_Id  Rating ID do filme
1  1488844     3.0           1
2   822109     5.0           1
3   885013     4.0           1
4    30878     4.0           1
5   823519     3.0           1

In [17]:
df = data.merge(data_rating, how='inner', on='ID do filme')

df.head()

  ID do filme Ano de lançamento           Título  Cust_Id  Rating
0           1              2003  Dinosaur Planet  1488844     3.0
1           1              2003  Dinosaur Planet   822109     5.0
2           1              2003  Dinosaur Planet   885013     4.0
3           1              2003  Dinosaur Planet    30878     4.0
4           1              2003  Dinosaur Planet   823519     3.0

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23806977 entries, 0 to 23806976
Data columns (total 5 columns):
 #   Column             Dtype
---  ------             -----
 0   ID do filme        object
 1   Ano de lançamento  object
 2   Título             object
 3   Cust_Id            object
 4   Rating             float64
dtypes: float64(1), object(4)
memory usage: 908.2+ MB

In [19]:
df.isnull().sum()

ID do filme          0
Ano de lançamento    0
Título               0
Cust_Id              0
Rating               0
dtype: int64

In [20]:
df.duplicated().sum()

0

In [21]:
df.shape

(23806977, 5)

In [22]:
df.loc[df['Ano de lançamento'].isnull(), 'Título']

Series([], Name: Título, dtype: object)

In [23]:
df = df.dropna(axis=0)
df.head()

  ID do filme Ano de lançamento           Título  Cust_Id  Rating
0           1              2003  Dinosaur Planet  1488844     3.0
1           1              2003  Dinosaur Planet   822109     5.0
2           1              2003  Dinosaur Planet   885013     4.0
3           1              2003  Dinosaur Planet    30878     4.0
4           1              2003  Dinosaur Planet   823519     3.0

In [24]:
df['ID do filme'] = pd.to_numeric(df['ID do filme'], errors='coerce').astype('Int64')
df['Cust_Id'] = pd.to_numeric(df['Cust_Id'], errors='coerce').astype('Int64')

In [25]:
df['Ano de lançamento'].replace('NULL', np.nan, inplace=True)

df['Ano de lançamento'] = pd.to_numeric(df['Ano de lançamento'], errors='coerce').astype('Int64')

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 23806977 entries, 0 to 23806976
Data columns (total 5 columns):
 #   Column             Dtype
---  ------             -----
 0   ID do filme        Int64
 1   Ano de lançamento  Int64
 2   Título             object
 3   Cust_Id            Int64
 4   Rating             float64
dtypes: Int64(3), float64(1), object(1)
memory usage: 976.3+ MB

In [27]:
df.describe()

       ID do filme  Ano de lançamento         Cust_Id        Rating
count   23806977.0         23806788.0      23806977.0  2.380698e+07
mean   2305.647091        1994.507948  1322279.229169  3.596911e+00
std    1307.053559          12.544601   764583.329916  1.085823e+00
min            1.0             1915.0             6.0  1.000000e+00
25%         1180.0             1991.0        660874.0  3.000000e+00
50%         2337.0             1999.0       1318608.0  4.000000e+00
75%         3434.0             2003.0       1984352.0  4.000000e+00
max         4498.0             2005.0       2649429.0  5.000000e+00

In [81]:
sampled_data = df.sample(n=30000)

matriz = sampled_data.pivot_table(values='Rating', index='Título', columns='Cust_Id')
matriz.fillna(0, inplace=True)

from scipy.sparse import csc_matrix
matriz_esparsa = csc_matrix(matriz)

In [83]:
matriz_esparsa.shape

(2465, 27418)

In [84]:
from sklearn.neighbors import NearestNeighbors

model = NearestNeighbors(n_neighbors=5,
                         algorithm='auto',
                         metric="minkowski")
model.fit(matriz_esparsa)

NearestNeighbors()

In [86]:
for posicao, titulo in enumerate(matriz.index):
    if 'Black' in str(titulo):
        print(posicao, titulo)

253 Black Adder
254 Black Adder Back & Forth
255 Black Dog
256 Black Jack: The Movie
257 Black Mask
258 Black Orpheus
259 Black and White
260 Blacktop
783 Good Guys Wear Black
1181 Men in Black II
1393 Pirates of the Caribbean: The Curse of the Black Pearl
1836 The Big Black Comedy Show: Vol. 1
2456 Young Black Stallion

In [88]:
filme = matriz_esparsa[2456, :].reshape(1, -1)
distancia, recomendacao = model.kneighbors(filme)

In [89]:
recomendacao

array([[2456,   78,   34,  115,  150]], dtype=int64)

In [90]:
for filme in range(len(recomendacao)):
    print(matriz.index[recomendacao[filme]])

Index(['Young Black Stallion', 'Afterburn', 'A Farewell to Arms',
       'America's Most Haunted Town', 'Arjuna: Complete Collection'],
      dtype='object', name='Título')